ConnectTest/src/Enums/ОперационныеСистемы/ОперационныеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперационныеСистемы</name>
  <enumValues>
    <name>Android</name>
  </enumValues>
  <enumValues>
    <name>iOS</name>
  </enumValues>
  <enumValues>
    <name>Web</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/Токены/Токены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Токены</name>
  <attributes>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef.ВидыПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.ОперационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Сети</types>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствоватьВРассылкеEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствоватьВРассылкеСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьОбновлятьПерсональныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/Сети/Сети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сети</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>EnumRef.ВидыБрендов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>CatalogRef.МаскиНомеровТелефонов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>EnumRef.ТипыПрограммЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/CommonModules/ОбщегоНазначенияПовторноеИспользование/Module.bsl
Функция УзелСообщенияКОтправке(КаналИнформирования) Экспорт
	Возврат ПланыОбмена.СообщенияКОтправке.НайтиПоРеквизиту("КаналИнформирования", КаналИнформирования);	
КонецФункции

Функция УзелСообщенияПроверкаСтатуса(КаналИнформирования) Экспорт
	Возврат ПланыОбмена.СообщенияПроверкаСтатуса.НайтиПоРеквизиту("КаналИнформирования", КаналИнформирования);	
КонецФункции

Функция УзелРегистрацияПользователя(ТипРегистрации) Экспорт
	Возврат ПланыОбмена.РегистрацияПользователей.НайтиПоРеквизиту("ТипРегистрации", ТипРегистрации);	
КонецФункции

Функция ДанныеАутентификации(ОперационнаяСистема, Сертификат) Экспорт
	Если ОперационнаяСистема = Перечисления.ОперационныеСистемы.Android Тогда
		Возврат Сертификат;
	Иначе	
		Возврат ПолучитьОбщийМакет(Сертификат);
	КонецЕсли;
КонецФункции

Function checkToken(language, token) Export
	
	answer		= New Structure();
	answer.Insert("token", Catalogs.Токены.EmptyRef());
	answer.Insert("user", Catalogs.Пользователи.EmptyRef());
	answer.Insert("userType", "");
	answer.Insert("holding", Catalogs.Холдинги.EmptyRef());
	answer.Insert("chain", Catalogs.Сети.EmptyRef());
	answer.Insert("appType", Catalogs.ВидыПриложений.EmptyRef());
	answer.Insert("systemType", Перечисления.ОперационныеСистемы.EmptyRef());
	answer.Insert("timezone", Catalogs.ЧасовыеПояса.EmptyRef());
	answer.Insert("errorDescription", Service.getErrorDescription(language, "userNotIdentified"));		
	
	If ValueIsFilled(token) Then
		
		query = New Query();			
		query.Text	= "ВЫБРАТЬ
		|	ВЗ.token КАК token,
		|	ВЗ.user КАК user,
		|	ВЗ.userType КАК userType,
		|	ВЗ.chain КАК chain,
		|	ВЗ.holding КАК holding,
		|	ВЗ.appType КАК appType,
		|	ВЗ.systemType КАК systemType,
		|	ВЗ.timezone КАК timezone
		|ИЗ
		|	(ВЫБРАТЬ
		|		Токены.Ссылка КАК token,
		|		Токены.Пользователь КАК user,
		|		Токены.Пользователь.ТипПользователя КАК userType,
		|		Токены.Сеть КАК chain,
		|		Токены.Холдинг КАК holding,
		|		Токены.ВидПриложения КАК appType,
		|		Токены.ОперационнаяСистема КАК systemType,
		|		Токены.ЧасовойПояс КАК timezone,
		|		Токены.ДатаБлокировки КАК ДатаБлокировки
		|	ИЗ
		|		Справочник.Токены КАК Токены
		|	ГДЕ
		|		Токены.Ссылка = &token) КАК ВЗ
		|ГДЕ
		|	ВЗ.ДатаБлокировки = ДАТАВРЕМЯ(1, 1, 1)";
		
		query.SetParameter("token", XMLValue(Type("CatalogRef.Токены"), token));		
		
		queryResult	= query.Execute();		
		
		If Not queryResult.IsEmpty() Then
			selection	= queryResult.Select();
			selection.Next();		
			answer.Insert("token", selection.token);
			answer.Insert("user", selection.user);
			answer.Insert("userType", selection.ТипПользователя);
			answer.Insert("holding", selection.Холдинг);
			answer.Insert("chain", selection.Сеть);
			answer.Insert("appType", selection.ВидПриложения);
			answer.Insert("systemType", selection.ОперационнаяСистема);
			answer.Insert("timezone", selection.ЧасовойПояс);
			answer.Insert("errorDescription", Service.getErrorDescription(language, ""));
		EndIf;		
	
	EndIf;
	
	Return answer;
	
EndFunction

Функция ПолучитьБазовыйURL() Экспорт
	Возврат  Константы.БазовыйURL.Получить();	
КонецФункции

Function phoneMasksList() Export
	
	array	= New Array();		
	query	= New Query();
	
	query.Text	= "ВЫБРАТЬ
	|	МаскиНомеровТелефонов.КодСтраны,
	|	МаскиНомеровТелефонов.Description
	|ИЗ
	|	Справочник.МаскиНомеровТелефонов КАК МаскиНомеровТелефонов
	|ГДЕ
	|	Не МаскиНомеровТелефонов.ПометкаУдаления";
	
	selection	= query.Execute().Select();
	
	While selection.Next() Do
		answer	= New Structure();
		answer.Вставить("code", selection.КодСтраны);
		answer.Вставить("mask", selection.Description);		
		array.add(answer);
	EndDo;
		
	Return array;
	
EndFunction
